cf/Documents/КорректировкаЗаказаПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>КорректировкаЗаказаПокупателя</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыПоставщиковВПути</xr:Item>
				<xr:Item>AccumulationRegister.НеудоволетворенныйСпрос</xr:Item>
				<xr:Item>AccumulationRegister.Лимиты</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезерве</xr:Item>
				<xr:Item>AccumulationRegister.РазмещениеЗаказовВПути</xr:Item>
				<xr:Item>AccumulationRegister.ДолгиПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.РазмещениеЗаказов</xr:Item>
				<xr:Item>AccumulationRegister.ДолгиПоОтгрузкам</xr:Item>
				<xr:Item>AccumulationRegister.ОтгруженныеЗаказы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияРасход</Name>
					<Comment>Нужен чтобы документ стал отменой заказа, для того чтобы считывать только положительные записи минуя отрицательные при обороте а при закрытии такого нет вот типа отмена а так была бы корректировака а тут бац и отмена</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезДвиженийПоРезерву</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЗакрытиеЗаказа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентАвтоматическойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Акция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Акция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазмещениеТоваров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Размещение</Name>
							<Comment>Размещение до перехода на безсуммуразмещений</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Размещение</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Очередь</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Очередь</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/AccumulationRegisters/РазмещениеЗаказовВПути.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>РазмещениеЗаказовВПути</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Размещение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Очередь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Documents/ЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЗаказПоставщику</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикам</xr:Item>
				<xr:Item>InformationRegister.РасчетныеСрокиДвиженияЗаказа</xr:Item>
				<xr:Item>AccumulationRegister.ДолгиПоЗаказамПоставщику</xr:Item>
				<xr:Item>AccumulationRegister.РазмещениеЗаказовВПути</xr:Item>
				<xr:Item>AccumulationRegister.РазмещениеЗаказов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРазмещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срочный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.СогласованиеЗаказаПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеПроцДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеПроцПосле</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>стрУсловийОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьОплату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказаПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АртикулПоставщика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПодтвержденное</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПодтвержденная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Резервы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Размещение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Очередь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>План</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/КорректировкаЗаказаПокупателя/Ext/ManagerModule.bsl
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	ИменаРегистров = Новый Массив;
	ПоВсем=Ложь;
	Если Не ДополнительныеСвойства.Свойство("ИменаРегистров",ИменаРегистров) Тогда
		ПоВсем=Истина;
		ИменаРегистров = Новый Массив;
	КонецЕсли;	
	
	ТекстЗапроса=КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() +Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+

		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказПокупателя.Заказ
		|ИЗ
		|	Документ.КорректировкаЗаказаПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Ссылка = &Ссылка"
		;
		
	Нтаб=Новый Структура;
	ТекНомер=1;	
	
	Если ИменаРегистров.Найти("ЗаказыПокупателей")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ЗаказыПокупателей",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+

	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&Период				КАК Период,
	|	ВЫБОР КОГДА Ссылка.ВидДвиженияРасход = ИСТИНА ТОГДА &ВидДвиженияРасход ИНАЧЕ &ВидДвиженияПриход КОНЕЦ ВидДвижения,
	|	Ссылка.Заказ		КАК ЗаказПокупателя,
	|	Номенклатура,
	|	Упаковка,
	|	Цена,
	|	Акция,
	|	Размещение,
	|	ПроцентРучнойСкидки,
	|	ПроцентАвтоматическойСкидки,
	|	СтавкаНДС,
	|	СУММА(Количество)	КАК Количество,
    |	СУММА(Сумма)		КАК Сумма
	|ИЗ
	|	Документ.КорректировкаЗаказаПокупателя.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Ссылка,
	|	Номенклатура,
	|	Упаковка,
	|	Цена,
	|	Акция,
	|	Размещение,
	|	ПроцентРучнойСкидки,
	|	ПроцентАвтоматическойСкидки,
	|	СтавкаНДС"
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("ТоварыВРезерве")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ТоварыВРезерве",ТекНомер);
		
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&Период				КАК Период,
	|	ВЫБОР КОГДА Ссылка.ВидДвиженияРасход = ИСТИНА ТОГДА &ВидДвиженияРасход ИНАЧЕ &ВидДвиженияПриход КОНЕЦ ВидДвижения,
	|	Размещение,
	|	Ссылка.Заказ		КАК ДокументРезерва,
	|	Номенклатура,
	|	ВЫБОР 	КОГДА Упаковка = &ПустаяУпаковка 
	|			ТОГДА СУММА(Количество)	
    |			ИНАЧЕ СУММА(Количество)*Упаковка.Коэффициент  КОНЕЦ КАК Количество
	|ИЗ
	|	Документ.КорректировкаЗаказаПокупателя.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка И НЕ Ссылка.БезДвиженийПоРезерву И
	|	Размещение ССЫЛКА Справочник.Склады  И
	|	ЕСТЬNULL(Размещение, &ПустойСклад) <> &ПустойСклад
	|
	|СГРУППИРОВАТЬ ПО
	|	Ссылка,
	|	Размещение,
	|	Номенклатура,
	|	Упаковка
	|ИМЕЮЩИЕ СУММА(Количество) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	ВЫБОР КОГДА Ссылка.ВидДвиженияРасход = ИСТИНА ТОГДА &ВидДвиженияРасход ИНАЧЕ &ВидДвиженияПриход КОНЕЦ ВидДвижения,
	|	Размещение,
	|	Ссылка.Заказ		КАК ДокументРезерва,
	|	Номенклатура,
	|	СУММА(Количество)	КАК Количество
	|ИЗ
	|	Документ.КорректировкаЗаказаПокупателя.РазмещениеТоваров	
	|ГДЕ
	|	Ссылка = &Ссылка И НЕ Ссылка.БезДвиженийПоРезерву И
	|	Размещение ССЫЛКА Справочник.Склады  И
	|	ЕСТЬNULL(Размещение, &ПустойСклад) <> &ПустойСклад
	|
	|СГРУППИРОВАТЬ ПО
	|	Ссылка, Размещение, Номенклатура"
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("РазмещениеЗаказов")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("РазмещениеЗаказов",ТекНомер);
		
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&Период				КАК Период,
	|	ВЫБОР КОГДА Ссылка.ВидДвиженияРасход = ИСТИНА ТОГДА &ВидДвиженияРасход ИНАЧЕ &ВидДвиженияПриход КОНЕЦ ВидДвижения,
	|	Размещение 			КАК Очередь,
	|	Ссылка.Заказ		КАК Заказ,
	|	Номенклатура,
	|	Упаковка,
	|	СУММА(Количество)	КАК Количество
	|ИЗ
	|	Документ.КорректировкаЗаказаПокупателя.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка И
	|	Ссылка = &Ссылка И ТИПЗНАЧЕНИЯ(Размещение) = ТИП(ЧИСЛО)
	//|	НЕ Размещение ССЫЛКА Справочник.Склады И Размещение <> Неопределено И ЕСТЬNULL(Размещение, 0) <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР КОГДА Ссылка.ВидДвиженияРасход = ИСТИНА ТОГДА &ВидДвиженияРасход ИНАЧЕ &ВидДвиженияПриход КОНЕЦ,
	|	Размещение,
	|	Ссылка.Заказ,
	|	Номенклатура,
	|	Упаковка
	|ИМЕЮЩИЕ СУММА(Количество) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	ВЫБОР КОГДА Ссылка.ВидДвиженияРасход = ИСТИНА ТОГДА &ВидДвиженияРасход ИНАЧЕ &ВидДвиженияПриход КОНЕЦ ВидДвижения,
	|	Размещение 			Очередь,
	|	Ссылка.Заказ		КАК Заказ,
	|	Номенклатура,
	|	&ПустаяУпаковка,
	|	СУММА(Количество) Количество
    |ИЗ
	|	Документ.КорректировкаЗаказаПокупателя.РазмещениеТоваров
	|
	|ГДЕ
	|	Ссылка = &Ссылка И
	|	ТИПЗНАЧЕНИЯ(Размещение) = ТИП(ЧИСЛО) И
	|	Размещение <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Ссылка, Размещение, Номенклатура"
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("ДолгиПоЗаказам")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ДолгиПоЗаказам",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
	"ВЫБРАТЬ
	|	&Период				Период,
	|	&ВидДвиженияПриход	ВидДвижения,
	|	Заказ.Организация	Организация,
	|	Заказ.Партнер		Партнер,
	|	Заказ.Контрагент	Контрагент,
	|	Заказ				Заказ,
	|	&СуммаДокумента		Сумма
	|ИЗ
	|	Документ.КорректировкаЗаказаПокупателя
	|ГДЕ
	|	Ссылка = &Ссылка и &СуммаДокумента<>0 и (Заказ.Склад.ПередачаТовараМВЗ=Ложь И Заказ.МВЗ=Значение(Справочник.МВЗ.ПустаяСсылка) И Заказ.ПередачаТовара=Ложь)"
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("ДолгиПоОтгрузкам")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ДолгиПоОтгрузкам",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		"ВЫБРАТЬ
		|	""стиратель движений"""
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("ОтгруженныеЗаказы")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ОтгруженныеЗаказы",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&Период	Период,
	|	Ссылка.Заказ Заказ,
	|	СУММА(Номенклатура.Вес * ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА Количество ИНАЧЕ Количество * Упаковка.Коэффициент КОНЕЦ) 	ВесЗаказа,
	|	СУММА(Номенклатура.Объем * ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА Количество ИНАЧЕ Количество * Упаковка.Коэффициент КОНЕЦ) 	ОбъемЗаказа
	|ИЗ
	|	Документ.КорректировкаЗаказаПокупателя.Товары
	|ГДЕ
	|	Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Ссылка"
	КонецЕсли;	
	
	Если ИменаРегистров.Найти("Лимиты")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("Лимиты",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
	"ВЫБРАТЬ
	|   &Период,
	|	&ВидДвиженияРасход		ВидДвижения,
	|	Ссылка.Заказ.ОтветственноеЛицо	Инициатор,
	|	СУММА(Сумма) 			Сумма
	|ИЗ
	|	Документ.КорректировкаЗаказаПокупателя.Товары
	|ГДЕ
	|   Ссылка = &Ссылка И Ссылка.Заказ.ОтветственноеЛицо <> &ПустойИнициатор
	|СГРУППИРОВАТЬ ПО Ссылка
	|ИМЕЮЩИЕ СУММА(Сумма) <> 0"
	КонецЕсли;	
	
	Если ИменаРегистров.Найти("РазмещениеЗаказовВПути")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+3;
		Нтаб.Вставить("РазмещениеЗаказовВПути",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		"ВЫБРАТЬ
		|	ЗаказПокупателяРазмещениеТоваров.Номенклатура
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	Документ.КорректировкаЗаказаПокупателя.РазмещениеТоваров КАК ЗаказПокупателяРазмещениеТоваров
		|ГДЕ
		|	ЗаказПокупателяРазмещениеТоваров.Ссылка = &Ссылка
		|	И ЗаказПокупателяРазмещениеТоваров.Размещение ССЫЛКА Документ.ЗаказПоставщику
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РазмещениеЗаказовВПутиОстатки.Номенклатура,
		|	МАКСИМУМ(РазмещениеЗаказовВПутиОстатки.Очередь) КАК Очередь
		|ПОМЕСТИТЬ ТаблОчереди
		|ИЗ
		|	РегистрНакопления.РазмещениеЗаказовВПути.Остатки(
		|			&ПериодОчереди,
		|			Номенклатура В
		|				(ВЫБРАТЬ
		|					Товары.Номенклатура
		|				ИЗ
		|					Товары)) КАК РазмещениеЗаказовВПутиОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РазмещениеЗаказовВПутиОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период КАК Период,
		|	&ВидДвиженияПриход 		КАК ВидДвижения,
		|	ЕСТЬNULL(Оч.Очередь, 1) КАК Очередь,
		|	Док.Ссылка.Заказ 		КАК Размещение,
		|	Док.Номенклатура 		КАК Номенклатура,
		|	Док.Размещение 			КАК ЗаказПоставщику,
		|	СУММА(Док.Количество) 	КАК Количество
		|ИЗ
		|	Документ.КорректировкаЗаказаПокупателя.РазмещениеТоваров КАК Док
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблОчереди КАК Оч
		|		ПО Док.Номенклатура = Оч.Номенклатура
		|ГДЕ
		|	Док.Ссылка = &Ссылка
		|	И Док.Размещение ССЫЛКА Документ.ЗаказПоставщику
		|
		|СГРУППИРОВАТЬ ПО
		|	Док.Ссылка,
		|	ЕСТЬNULL(Оч.Очередь, 1),
		|	Док.Размещение,
		|	Док.Номенклатура"
	КонецЕсли;	
	
	
	//Запрос = Новый Запрос(
	//
	//КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + ";
	//
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	Заказ
	//|ИЗ
	//|	Документ.КорректировкаЗаказаПокупателя
	//|ГДЕ
	//|	Ссылка = &Ссылка
	//|;
	//
	//// ЗАКАЗЫ ПОКУПАТЕЛЕЙ
	//
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	&Период				КАК Период,
	//|	ВЫБОР КОГДА Ссылка.ВидДвиженияРасход = ИСТИНА ТОГДА &ВидДвиженияРасход ИНАЧЕ &ВидДвиженияПриход КОНЕЦ ВидДвижения,
	//|	Ссылка.Заказ		КАК ЗаказПокупателя,
	//|	Номенклатура,
	//|	Упаковка,
	//|	Цена,
	//|	Акция,
	//|	Размещение,
	//|	ПроцентРучнойСкидки,
	//|	ПроцентАвтоматическойСкидки,
	//|	СтавкаНДС,
	//|	СУММА(Количество)	КАК Количество,
	//|	СУММА(Сумма)		КАК Сумма
	//|ИЗ
	//|	Документ.КорректировкаЗаказаПокупателя.Товары
	//|
	//|ГДЕ
	//|	Ссылка = &Ссылка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Ссылка,
	//|	Номенклатура,
	//|	Упаковка,
	//|	Цена,
	//|	Акция,
	//|	Размещение,
	//|	ПроцентРучнойСкидки,
	//|	ПроцентАвтоматическойСкидки,
	//|	СтавкаНДС
	//|;
	//
	//// ТОВАРЫ В РЕЗЕРВЕ
	//
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	&Период				КАК Период,
	//|	ВЫБОР КОГДА Ссылка.ВидДвиженияРасход = ИСТИНА ТОГДА &ВидДвиженияРасход ИНАЧЕ &ВидДвиженияПриход КОНЕЦ ВидДвижения,
	//|	Размещение,
	//|	Ссылка.Заказ		КАК ДокументРезерва,
	//|	Номенклатура,
	//|	ВЫБОР 	КОГДА Упаковка = &ПустаяУпаковка 
	//|			ТОГДА СУММА(Количество)	
	//|			ИНАЧЕ СУММА(Количество)*Упаковка.Коэффициент  КОНЕЦ КАК Количество
	//|ИЗ
	//|	Документ.КорректировкаЗаказаПокупателя.Товары
	//|
	//|ГДЕ
	//|	Ссылка = &Ссылка И НЕ Ссылка.БезДвиженийПоРезерву И
	//|	Размещение ССЫЛКА Справочник.Склады  И
	//|	ЕСТЬNULL(Размещение, &ПустойСклад) <> &ПустойСклад
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Ссылка,
	//|	Размещение,
	//|	Номенклатура,
	//|	Упаковка
	//|ИМЕЮЩИЕ СУММА(Количество) <> 0
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	&Период				КАК Период,
	//|	ВЫБОР КОГДА Ссылка.ВидДвиженияРасход = ИСТИНА ТОГДА &ВидДвиженияРасход ИНАЧЕ &ВидДвиженияПриход КОНЕЦ ВидДвижения,
	//|	Размещение,
	//|	Ссылка.Заказ		КАК ДокументРезерва,
	//|	Номенклатура,
	//|	СУММА(Количество)	КАК Количество
	//|ИЗ
	//|	Документ.КорректировкаЗаказаПокупателя.РазмещениеТоваров	
	//|ГДЕ
	//|	Ссылка = &Ссылка И НЕ Ссылка.БезДвиженийПоРезерву И
	//|	Размещение ССЫЛКА Справочник.Склады  И
	//|	ЕСТЬNULL(Размещение, &ПустойСклад) <> &ПустойСклад
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Ссылка, Размещение, Номенклатура
	//|;
	//
	//// РАЗМЕЩЕНИЕ ЗАКАЗОВ
	//
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	&Период				КАК Период,
	//|	ВЫБОР КОГДА Ссылка.ВидДвиженияРасход = ИСТИНА ТОГДА &ВидДвиженияРасход ИНАЧЕ &ВидДвиженияПриход КОНЕЦ ВидДвижения,
	//|	Размещение 			КАК Очередь,
	//|	Ссылка.Заказ		КАК Заказ,
	//|	Номенклатура,
	//|	Упаковка,
	//|	СУММА(Количество)	КАК Количество
	//|ИЗ
	//|	Документ.КорректировкаЗаказаПокупателя.Товары
	//|
	//|ГДЕ
	//|	Ссылка = &Ссылка И
	//|	Ссылка = &Ссылка И ТИПЗНАЧЕНИЯ(Размещение) = ТИП(ЧИСЛО)
	////|	НЕ Размещение ССЫЛКА Справочник.Склады И Размещение <> Неопределено И ЕСТЬNULL(Размещение, 0) <> 0
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВЫБОР КОГДА Ссылка.ВидДвиженияРасход = ИСТИНА ТОГДА &ВидДвиженияРасход ИНАЧЕ &ВидДвиженияПриход КОНЕЦ,
	//|	Размещение,
	//|	Ссылка.Заказ,
	//|	Номенклатура,
	//|	Упаковка
	//|ИМЕЮЩИЕ СУММА(Количество) <> 0
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	&Период				КАК Период,
	//|	ВЫБОР КОГДА Ссылка.ВидДвиженияРасход = ИСТИНА ТОГДА &ВидДвиженияРасход ИНАЧЕ &ВидДвиженияПриход КОНЕЦ ВидДвижения,
	//|	Размещение 			Очередь,
	//|	Ссылка.Заказ		КАК Заказ,
	//|	Номенклатура,
	//|	&ПустаяУпаковка,
	//|	СУММА(Количество) Количество
	//|ИЗ
	//|	Документ.КорректировкаЗаказаПокупателя.РазмещениеТоваров
	//|
	//|ГДЕ
	//|	Ссылка = &Ссылка И
	//|	ТИПЗНАЧЕНИЯ(Размещение) = ТИП(ЧИСЛО) И
	//|	Размещение <> 0
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Ссылка, Размещение, Номенклатура
	//|;
	//
	////// ДОЛГИ ПО ОТГРУЗКАМ 1
	////
	////|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	////|	ДокументОтгрузки,
	////|	-СуммаОстаток Сумма
	////|ИЗ
	////|	РегистрНакопления.ДолгиПоОтгрузкам.Остатки(&Период, 
	////|									Организация = &Организация И 
	////|									Партнер 	= &Партнер И 
	//////|									Контрагент 	= &Контрагент И 
	////|									Заказ 		= НЕОПРЕДЕЛЕНО)
	////|ГДЕ
	////|	СуммаОстаток < 0
	////|;
	////
	////// ДОЛГИ ПО ОТГРУЗКАМ 2
	////
	////|ВЫБРАТЬ РАЗРЕШЕННЫЕ								// движение по долгу
	////|	&Период				Период,
	////|	&ВидДвиженияПриход	ВидДвижения,
	////|	НЕОПРЕДЕЛЕНО		ДокументОтгрузки,
	////|	Заказ.Организация	Организация,
	////|	Заказ.Партнер		Партнер,
	////|	Заказ.Контрагент	Контрагент,
	////|	Заказ				Заказ,
	////|	Сумма				Сумма
	////|ИЗ
	////|	Документ.КорректировкаЗаказаПокупателя
	////|ГДЕ
	////|	Ссылка = &Ссылка И Сумма <> 0
	////|;
	//
	//
	//// Долги по заказам
	//|ВЫБРАТЬ
	//|	&Период				Период,
	//|	&ВидДвиженияПриход	ВидДвижения,
	//|	Заказ.Организация	Организация,
	//|	Заказ.Партнер		Партнер,
	//|	Заказ.Контрагент	Контрагент,
	//|	Заказ				Заказ,
	//|	&СуммаДокумента		Сумма
	//|ИЗ
	//|	Документ.КорректировкаЗаказаПокупателя
	//|ГДЕ
	//|	Ссылка = &Ссылка
	//|;
	//
	//
	//// ОТГРУЖЕННЫЕ ЗАКАЗЫ

	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	&Период	Период,
	//|	Ссылка.Заказ Заказ,
	//|	СУММА(Номенклатура.Вес * ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА Количество ИНАЧЕ Количество * Упаковка.Коэффициент КОНЕЦ) 	ВесЗаказа,
	//|	СУММА(Номенклатура.Объем * ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА Количество ИНАЧЕ Количество * Упаковка.Коэффициент КОНЕЦ) 	ОбъемЗаказа
	//|ИЗ
	//|	Документ.КорректировкаЗаказаПокупателя.Товары
	//|ГДЕ
	//|	Ссылка = &Ссылка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Ссылка
	//|;
	//
	//// ЛИМИТЫ
	//
	//|ВЫБРАТЬ
	//|   &Период,
	//|	&ВидДвиженияРасход		ВидДвижения,
	//|	Ссылка.Заказ.ОтветственноеЛицо	Инициатор,
	//|	СУММА(Сумма) 			Сумма
	//|ИЗ
	//|	Документ.КорректировкаЗаказаПокупателя.Товары
	//|ГДЕ
	//|   Ссылка = &Ссылка И Ссылка.Заказ.ОтветственноеЛицо <> &ПустойИнициатор
	//|СГРУППИРОВАТЬ ПО Ссылка
	//|ИМЕЮЩИЕ СУММА(Сумма) <> 0
	//|;
	//|
	//
	//// Вычисляем последюю очередь (глупо но времени нет, от очереди в регистре надо избавлятся)
	//
	//|ВЫБРАТЬ Номенклатура, МАКСИМУМ(Очередь) Очередь
	//|ПОМЕСТИТЬ ТаблОчереди
	//|ИЗ РегистрНакопления.РазмещениеЗаказовВПути.Остатки(
	//|										&ПериодОчереди, 
	//|										Размещение = &Заказ И
	//|										Номенклатура В(ВЫБРАТЬ РАЗЛИЧНЫЕ Номенклатура ИЗ Документ.КорректировкаЗаказаПокупателя.РазмещениеТоваров ГДЕ Ссылка = &Ссылка И Размещение ССЫЛКА Документ.ЗаказПоставщику))
	//|СГРУППИРОВАТЬ ПО Номенклатура;
	//
	//// РАЗМЕЩЕНИЕ ЗАКАЗОВ В ПУТИ
	//
	//|ВЫБРАТЬ
	//|	&Период				КАК Период,
	//|	&ВидДвиженияПриход  КАК ВидДвижения,
	//|	ЕСТЬNULL(Оч.Очередь , 1) КАК Очередь,
	//|	Ссылка.Заказ		КАК Размещение,
	//|	Док.Номенклатура	КАК Номенклатура,
	//|	Размещение			КАК ЗаказПоставщику,
	//|	СУММА(Количество)	Количество
	//|ИЗ
	//|	Документ.КорректировкаЗаказаПокупателя.РазмещениеТоваров Док
	//|
	//|ЛЕВОЕ СОЕДИНЕНИЕ 	ТаблОчереди Оч
	//|ПО					Док.Номенклатура = Оч.Номенклатура
	//|
	//|ГДЕ
	//|	Ссылка = &Ссылка И Размещение ССЫЛКА Документ.ЗаказПоставщику
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Ссылка,
	//|	ЕСТЬNULL(Оч.Очередь , 1),
	//|	Размещение,
	//|	Док.Номенклатура
	//|");
	
	Запрос=Новый Запрос;
	Запрос.Текст=ТекстЗапроса;
	
	//Запрос.УстановитьПараметр("Область", 			ПараметрыСеанса.ТекущаяОбласть);
	Запрос.УстановитьПараметр("Организация", 			Ссылка.Заказ.Организация);
	Запрос.УстановитьПараметр("Партнер", 				Ссылка.Заказ.Партнер);
	Запрос.УстановитьПараметр("Контрагент", 			Ссылка.Заказ.Контрагент);
	Запрос.УстановитьПараметр("СуммаДокумента", 		Ссылка.Сумма);
	Запрос.УстановитьПараметр("Заказ", 					Ссылка.Заказ);
	
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Период", 			Ссылка.Дата);
	Запрос.УстановитьПараметр("ПериодОчереди", 		?(НачалоДня(Ссылка.Дата) = НачалоДня(ТекущаяДата()), НачалоДня(ТекущаяДата()), Ссылка.Дата));
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидДвиженияРасход", 	ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ПустойСклад", 		Справочники.Склады.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяУпаковка", 	Справочники.УпаковкиНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойИнициатор", 	Справочники.ФизическиеЛица.ПустаяСсылка());

	Пакет = Запрос.ВыполнитьПакет();
	ПараметрыСистемы = КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить());
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", 	ПараметрыСистемы);
	ДополнительныеСвойства.Вставить("Шапка", 				КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить()));
	
	Для Каждого Элем Из Нтаб Цикл
		ДополнительныеСвойства.Вставить(Элем.Ключ,Пакет[Элем.Значение].Выгрузить());
	КонецЦикла;	
	
	ДополнительныеСвойства.Вставить("ДолгиПоОтгрузкам", Новый ТаблицаЗначений);  //очистка
	
	
	//ДополнительныеСвойства.Вставить("ЗаказыПокупателей", 	Пакет[2].Выгрузить());
	//ДополнительныеСвойства.Вставить("ТоварыВРезерве", 		Пакет[3].Выгрузить());
	//ДополнительныеСвойства.Вставить("РазмещениеЗаказов", 	Пакет[4].Выгрузить());
	//ДополнительныеСвойства.Вставить("ДолгиПоЗаказам", Пакет[5].Выгрузить());
	//ДополнительныеСвойства.Вставить("ОтгруженныеЗаказы", 	Пакет[6].Выгрузить());
	//ДополнительныеСвойства.Вставить("Лимиты", 				Пакет[7].Выгрузить());
	//ДополнительныеСвойства.Вставить("РазмещениеЗаказовВПути", 	Пакет[9].Выгрузить());
	
	Если ДополнительныеСвойства.Свойство("ЗаказыПокупателей") Тогда
		ДополнительныеСвойства.Вставить("НеудоволетворенныйСпрос", РаботаСНоменклатурой.ОпределитьНеудовлетворенныйСпрос(ДополнительныеСвойства.ЗаказыПокупателей, Ссылка.Заказ, Ссылка.Заказ.Склад, Ссылка.Заказ.Подразделение, Ссылка.Дата));
	КонецЕсли;
	
КонецПроцедуры
